#+title: 자연어 처리 2
#+subtitle: 6 weeks by ???
#+date: <2020-09-22 Wed 18:00>
#+tags: python, bash, elisp, lisp, zoom
#+property: header-args:bash :results verbatim
#+property: header-args:elisp :exports both
#+property: header-args:ipython :session mglearn22 :tangle "mglearn200922.py" :exports both

#+author: srolisp

# #+begin_src bash
#   # jupyter nbconvert --to script "DataScience/source_code/text분류.ipynb"
#   # jupyter nbconvert --to script "DataScience/source_code/의류분류.ipynb" 
# #+end_src

** TensorFlow
#+begin_src bash
  pip install tensorflow
#+end_src

#+RESULTS:
| Collecting   | tensorflow                                          |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | tensorflow-2.3.0-cp37-cp37m-macosx_10_11_x86_64.whl | (165.1         | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | tensorboard<3,>=2.3.0                               |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | tensorboard-2.3.0-py3-none-any.whl                  | (6.8           | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | wheel>=0.26                                                                                       | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | tensorflow)                                             | (0.35.1)                                                                          |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | opt-einsum>=2.3.2                                   |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | opt_einsum-3.3.0-py3-none-any.whl                   | (65            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | h5py<2.11.0,>=2.10.0                                |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | h5py-2.10.0-cp37-cp37m-macosx_10_6_intel.whl        | (3.0           | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | astunparse==1.6.3                                   |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | astunparse-1.6.3-py2.py3-none-any.whl               | (12            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | wrapt>=1.11.1                                                                                     | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | tensorflow)                                             | (1.12.1)                                                                          |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | numpy<1.19.0,>=1.16.0                               |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | numpy-1.18.5-cp37-cp37m-macosx_10_9_x86_64.whl      | (15.1          | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | protobuf>=3.9.2                                     |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | protobuf-3.13.0-cp37-cp37m-macosx_10_9_x86_64.whl   | (1.3           | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | gast==0.3.3                                         |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | gast-0.3.3-py2.py3-none-any.whl                     | (9.7           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | grpcio>=1.8.6                                       |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | grpcio-1.32.0-cp37-cp37m-macosx_10_9_x86_64.whl     | (3.3           | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | absl-py>=0.7.0                                      |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | absl_py-0.10.0-py3-none-any.whl                     | (127           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | tensorflow-estimator<2.4.0,>=2.3.0                  |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | tensorflow_estimator-2.3.0-py2.py3-none-any.whl     | (459           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | six>=1.12.0                                                                                       | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | tensorflow)                                             | (1.15.0)                                                                          |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | scipy==1.4.1                                        |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | scipy-1.4.1-cp37-cp37m-macosx_10_6_intel.whl        | (28.4          | MB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | keras-preprocessing<1.2,>=1.1.1                     |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | Keras_Preprocessing-1.1.2-py2.py3-none-any.whl      | (42            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | termcolor>=1.1.0                                    |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | termcolor-1.1.0.tar.gz                              | (3.9           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | google-pasta>=0.1.8                                 |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | google_pasta-0.2.0-py3-none-any.whl                 | (57            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | google-auth-oauthlib<0.5,>=0.4.1                    |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | google_auth_oauthlib-0.4.1-py2.py3-none-any.whl     | (18            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | tensorboard-plugin-wit>=1.6.0                       |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | tensorboard_plugin_wit-1.7.0-py3-none-any.whl       | (779           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | markdown>=2.6.8                                     |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | Markdown-3.2.2-py3-none-any.whl                     | (88            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | requests<3,>=2.21.0                                                                               | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | tensorboard<3,>=2.3.0->tensorflow)                      | (2.24.0)                                                                          |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | google-auth<2,>=1.6.3                               |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | google_auth-1.21.2-py2.py3-none-any.whl             | (93            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | setuptools>=41.0.0                                                                                | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | tensorboard<3,>=2.3.0->tensorflow)                      | (49.6.0)                                                                          |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | werkzeug>=0.11.15                                   |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | Werkzeug-1.0.1-py2.py3-none-any.whl                 | (298           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | requests-oauthlib>=0.7.0                            |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | requests_oauthlib-1.3.0-py2.py3-none-any.whl        | (23            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | importlib-metadata;                                                                               | python_version                            | <                                                                                 | 3.8                                                                     | in                                                      | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from         | markdown>=2.6.8->tensorboard<3,>=2.3.0->tensorflow) | (1.7.0)                   |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | chardet<4,>=3.0.2                                                                                 | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | requests<3,>=2.21.0->tensorboard<3,>=2.3.0->tensorflow) | (3.0.4)                                                                           |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | idna<3,>=2.5                                                                                      | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | requests<3,>=2.21.0->tensorboard<3,>=2.3.0->tensorflow) | (2.10)                                                                            |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1                                                           | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | requests<3,>=2.21.0->tensorboard<3,>=2.3.0->tensorflow) | (1.25.10)                                                                         |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | certifi>=2017.4.17                                                                                | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | requests<3,>=2.21.0->tensorboard<3,>=2.3.0->tensorflow) | (2020.6.20)                                                                       |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | cachetools<5.0,>=2.0.0                              |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | cachetools-4.1.1-py3-none-any.whl                   | (10            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | rsa<5,>=3.1.4;                                      | python_version | >=                                                                                                | 3.5                                       |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | rsa-4.6-py3-none-any.whl                            | (47            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | pyasn1-modules>=0.2.1                               |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | pyasn1_modules-0.2.8-py2.py3-none-any.whl           | (155           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | oauthlib>=3.0.0                                     |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | oauthlib-3.1.0-py2.py3-none-any.whl                 | (147           | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Requirement  | already                                             | satisfied:     | zipp>=0.5                                                                                         | in                                        | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | importlib-metadata;                                     | python_version                                                                    | <             | 3.8                                                 | (3.1.0)                   |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Collecting   | pyasn1>=0.1.3                                       |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Downloading  | pyasn1-0.4.8-py2.py3-none-any.whl                   | (77            | kB)                                                                                               |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Building     | wheels                                              | for            | collected                                                                                         | packages:                                 | termcolor                                                                         |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Building     | wheel                                               | for            | termcolor                                                                                         | (setup.py):                               | started                                                                           |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Building     | wheel                                               | for            | termcolor                                                                                         | (setup.py):                               | finished                                                                          | with                                                                    | status                                                  | 'done'                                                                            |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Created      | wheel                                               | for            | termcolor:                                                                                        | filename=termcolor-1.1.0-py3-none-any.whl | size=4830                                                                         | sha256=3ff1ab2602b98f9ea3b9d7de2861d8f5003ded25af6d1ce47dc799b198e18b92 |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Stored       | in                                                  | directory:     | /Users/sroh/Library/Caches/pip/wheels/3f/e3/ec/8a8336ff196023622fbcb36de0c5a5c218cbb24111d1d4c7f2 |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Successfully | built                                               | termcolor      |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Installing   | collected                                           | packages:      | oauthlib,                                                                                         | requests-oauthlib,                        | cachetools,                                                                       | pyasn1,                                                                 | rsa,                                                    | pyasn1-modules,                                                                   | google-auth,  | google-auth-oauthlib,                               | tensorboard-plugin-wit,   | numpy,         | markdown,    | absl-py,       | protobuf,        | grpcio,         | werkzeug,    | tensorboard,         | opt-einsum,             | h5py,   | astunparse, | gast,             | tensorflow-estimator,        | scipy,           | keras-preprocessing,       | termcolor,      | google-pasta,  | tensorflow |
| Attempting   | uninstall:                                          | numpy          |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Found        | existing                                            | installation:  | numpy                                                                                             | 1.19.1                                    |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Uninstalling | numpy-1.19.1:                                       |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Successfully | uninstalled                                         | numpy-1.19.1   |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Attempting   | uninstall:                                          | scipy          |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Found        | existing                                            | installation:  | scipy                                                                                             | 1.5.2                                     |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Uninstalling | scipy-1.5.2:                                        |                |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Successfully | uninstalled                                         | scipy-1.5.2    |                                                                                                   |                                           |                                                                                   |                                                                         |                                                         |                                                                                   |               |                                                     |                           |                |              |                |                  |                 |              |                      |                         |         |             |                   |                              |                  |                            |                 |                |            |
| Successfully | installed                                           | absl-py-0.10.0 | astunparse-1.6.3                                                                                  | cachetools-4.1.1                          | gast-0.3.3                                                                        | google-auth-1.21.2                                                      | google-auth-oauthlib-0.4.1                              | google-pasta-0.2.0                                                                | grpcio-1.32.0 | h5py-2.10.0                                         | keras-preprocessing-1.1.2 | markdown-3.2.2 | numpy-1.18.5 | oauthlib-3.1.0 | opt-einsum-3.3.0 | protobuf-3.13.0 | pyasn1-0.4.8 | pyasn1-modules-0.2.8 | requests-oauthlib-1.3.0 | rsa-4.6 | scipy-1.4.1 | tensorboard-2.3.0 | tensorboard-plugin-wit-1.7.0 | tensorflow-2.3.0 | tensorflow-estimator-2.3.0 | termcolor-1.1.0 | werkzeug-1.0.1 |            |



** keras
#+begin_src bash
pip install keras
#+end_src

#+RESULTS:
| Collecting   | keras                            |             |                                                                                                   |                                                         |                                                                                   |                                                                         |              |          |
| Downloading  | Keras-2.4.3-py2.py3-none-any.whl | (36         | kB)                                                                                               |                                                         |                                                                                   |                                                                         |              |          |
| Requirement  | already                          | satisfied:  | numpy>=1.9.1                                                                                      | in                                                      | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | keras)       | (1.18.5) |
| Collecting   | pyyaml                           |             |                                                                                                   |                                                         |                                                                                   |                                                                         |              |          |
| Downloading  | PyYAML-5.3.1.tar.gz              | (269        | kB)                                                                                               |                                                         |                                                                                   |                                                                         |              |          |
| Requirement  | already                          | satisfied:  | h5py                                                                                              | in                                                      | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | keras)       | (2.10.0) |
| Requirement  | already                          | satisfied:  | scipy>=0.14                                                                                       | in                                                      | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | keras)       | (1.4.1)  |
| Requirement  | already                          | satisfied:  | six                                                                                               | in                                                      | /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages | (from                                                                   | h5py->keras) | (1.15.0) |
| Building     | wheels                           | for         | collected                                                                                         | packages:                                               | pyyaml                                                                            |                                                                         |              |          |
| Building     | wheel                            | for         | pyyaml                                                                                            | (setup.py):                                             | started                                                                           |                                                                         |              |          |
| Building     | wheel                            | for         | pyyaml                                                                                            | (setup.py):                                             | finished                                                                          | with                                                                    | status       | 'done'   |
| Created      | wheel                            | for         | pyyaml:                                                                                           | filename=PyYAML-5.3.1-cp37-cp37m-macosx_10_7_x86_64.whl | size=154180                                                                       | sha256=cd41a2528ae86e211e871b7db2d40b8ea426adc7d1d2f15ab2579889751c300f |              |          |
| Stored       | in                               | directory:  | /Users/sroh/Library/Caches/pip/wheels/5e/03/1e/e1e954795d6f35dfc7b637fe2277bff021303bd9570ecea653 |                                                         |                                                                                   |                                                                         |              |          |
| Successfully | built                            | pyyaml      |                                                                                                   |                                                         |                                                                                   |                                                                         |              |          |
| Installing   | collected                        | packages:   | pyyaml,                                                                                           | keras                                                   |                                                                                   |                                                                         |              |          |
| Successfully | installed                        | keras-2.4.3 | pyyaml-5.3.1                                                                                      |                                                         |                                                                                   |                                                                         |              |          |

** update pip
#+begin_src bash :results verbatim
 python -V
#+end_src

#+RESULTS:
: Python 3.7.0 (default, Jun 28 2018, 07:39:16) 
: [Clang 4.0.1 (tags/RELEASE_401/final)]

** konlpy
#+begin_src bash :results verbatim
pip install konlpy
#+end_src

#+RESULTS:
#+begin_example
Collecting konlpy
  Downloading konlpy-0.5.2-py2.py3-none-any.whl (19.4 MB)
Collecting beautifulsoup4==4.6.0
  Downloading beautifulsoup4-4.6.0-py3-none-any.whl (86 kB)
Collecting tweepy>=3.7.0
  Downloading tweepy-3.9.0-py2.py3-none-any.whl (30 kB)
Collecting JPype1>=0.7.0
  Downloading JPype1-1.0.2-cp37-cp37m-macosx_10_9_x86_64.whl (401 kB)
Requirement already satisfied: numpy>=1.6 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from konlpy) (1.18.5)
Collecting colorama
  Downloading colorama-0.4.3-py2.py3-none-any.whl (15 kB)
Collecting lxml>=4.1.0
  Downloading lxml-4.5.2-cp37-cp37m-macosx_10_9_x86_64.whl (4.4 MB)
Requirement already satisfied: six>=1.10.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from tweepy>=3.7.0->konlpy) (1.15.0)
Requirement already satisfied: requests[socks]>=2.11.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from tweepy>=3.7.0->konlpy) (2.24.0)
Requirement already satisfied: requests-oauthlib>=0.7.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from tweepy>=3.7.0->konlpy) (1.3.0)
Collecting typing-extensions; python_version < "3.8"
  Downloading typing_extensions-3.7.4.3-py3-none-any.whl (22 kB)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (1.25.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (3.0.4)
Requirement already satisfied: idna<3,>=2.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (2.10)
Requirement already satisfied: certifi>=2017.4.17 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (2020.6.20)
Collecting PySocks!=1.5.7,>=1.5.6; extra == "socks"
  Downloading PySocks-1.7.1-py3-none-any.whl (16 kB)
Requirement already satisfied: oauthlib>=3.0.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests-oauthlib>=0.7.0->tweepy>=3.7.0->konlpy) (3.1.0)
Installing collected packages: beautifulsoup4, tweepy, typing-extensions, JPype1, colorama, lxml, konlpy, PySocks
Successfully installed JPype1-1.0.2 PySocks-1.7.1 beautifulsoup4-4.6.0 colorama-0.4.3 konlpy-0.5.2 lxml-4.5.2 tweepy-3.9.0 typing-extensions-3.7.4.3
#+end_example
맥에서는 자바를 따로 설치 안해도 되나보다.

** test
#+begin_src ipython :results output
from konlpy.tag import Kkma
from konlpy.utils import pprint

kkma = Kkma()
pprint(kkma.sentences(u'네, 안녕하세요. 반갑습니다.'))
#+end_src

#+RESULTS:
: ['네, 안녕하세요.', '반갑습니다.']

#+begin_src ipython :results output

pprint(kkma.nouns(u'질문이나 건의사항은 깃헙 이슈 트래커에 남겨주세요.'))
#+end_src

#+RESULTS:
: ['질문', '건의', '건의사항', '사항', '깃헙', '이슈', '트래커']

** 실습
https://www.lucypark.kr/courses/2015-dm/text-mining.html

*** 필요 패키지 설치
#+begin_src ipython :results output
import nltk 
nltk.download('gutenberg')
nltk.download('maxent_treebank_pos_tagger')

#+end_src

#+RESULTS:
: [nltk_data] Downloading package gutenberg to /Users/sroh/nltk_data...
: [nltk_data]   Package gutenberg is already up-to-date!
: [nltk_data] Downloading package maxent_treebank_pos_tagger to
: [nltk_data]     /Users/sroh/nltk_data...
: [nltk_data]   Unzipping taggers/maxent_treebank_pos_tagger.zip.

#+begin_src bash :results verbatim
pip install -U gensim
#+end_src

#+RESULTS:
#+begin_example
Collecting gensim
  Downloading gensim-3.8.3-cp37-cp37m-macosx_10_9_x86_64.whl (24.2 MB)
Requirement already satisfied, skipping upgrade: scipy>=0.18.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from gensim) (1.4.1)
Requirement already satisfied, skipping upgrade: six>=1.5.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from gensim) (1.15.0)
Requirement already satisfied, skipping upgrade: numpy>=1.11.3 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from gensim) (1.18.5)
Collecting smart-open>=1.8.1
  Downloading smart_open-2.1.1.tar.gz (111 kB)
Requirement already satisfied, skipping upgrade: requests in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from smart-open>=1.8.1->gensim) (2.24.0)
Collecting boto
  Using cached boto-2.49.0-py2.py3-none-any.whl (1.4 MB)
Collecting boto3
  Downloading boto3-1.15.2-py2.py3-none-any.whl (129 kB)
Requirement already satisfied, skipping upgrade: chardet<4,>=3.0.2 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests->smart-open>=1.8.1->gensim) (3.0.4)
Requirement already satisfied, skipping upgrade: certifi>=2017.4.17 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests->smart-open>=1.8.1->gensim) (2020.6.20)
Requirement already satisfied, skipping upgrade: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests->smart-open>=1.8.1->gensim) (1.25.10)
Requirement already satisfied, skipping upgrade: idna<3,>=2.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests->smart-open>=1.8.1->gensim) (2.10)
Collecting s3transfer<0.4.0,>=0.3.0
  Downloading s3transfer-0.3.3-py2.py3-none-any.whl (69 kB)
Collecting botocore<1.19.0,>=1.18.2
  Downloading botocore-1.18.2-py2.py3-none-any.whl (6.6 MB)
Collecting jmespath<1.0.0,>=0.7.1
  Downloading jmespath-0.10.0-py2.py3-none-any.whl (24 kB)
Requirement already satisfied, skipping upgrade: python-dateutil<3.0.0,>=2.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from botocore<1.19.0,>=1.18.2->boto3->smart-open>=1.8.1->gensim) (2.8.1)
Building wheels for collected packages: smart-open
  Building wheel for smart-open (setup.py): started
  Building wheel for smart-open (setup.py): finished with status 'done'
  Created wheel for smart-open: filename=smart_open-2.1.1-py3-none-any.whl size=112413 sha256=ceba8798ef4894f0f25e4e31dc4ddc7044e9378b5d6041f0becfddb4009ccb1a
  Stored in directory: /Users/sroh/Library/Caches/pip/wheels/d5/75/1d/d3da0d094f5e2ea61bddb9cb8cd4bd3ab9fb648e7269620855
Successfully built smart-open
Installing collected packages: boto, jmespath, botocore, s3transfer, boto3, smart-open, gensim
Successfully installed boto-2.49.0 boto3-1.15.2 botocore-1.18.2 gensim-3.8.3 jmespath-0.10.0 s3transfer-0.3.3 smart-open-2.1.1
#+end_example

#+begin_src bash :results verbatim
pip install twython
#+end_src

#+RESULTS:
#+begin_example
Collecting twython
  Downloading twython-3.8.2-py3-none-any.whl (33 kB)
Requirement already satisfied: requests-oauthlib>=0.4.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from twython) (1.3.0)
Requirement already satisfied: requests>=2.1.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from twython) (2.24.0)
Requirement already satisfied: oauthlib>=3.0.0 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests-oauthlib>=0.4.0->twython) (3.1.0)
Requirement already satisfied: chardet<4,>=3.0.2 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests>=2.1.0->twython) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests>=2.1.0->twython) (1.25.10)
Requirement already satisfied: certifi>=2017.4.17 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests>=2.1.0->twython) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in /Users/sroh/.pyenv/versions/anaconda3-5.3.1/envs/uiap/lib/python3.7/site-packages (from requests>=2.1.0->twython) (2.10)
Installing collected packages: twython
Successfully installed twython-3.8.2
#+end_example

*** Read document
#+begin_src ipython :results output
from konlpy.corpus import kobill
files_en = kobill.fileids()
doc_en = kobill.open('158-0.txt').read()

print(doc_en[:10])

#+end_src

#+RESULTS:
: ﻿The Proje

#+begin_src ipython :results output
from konlpy.corpus import kobill    # Docs from pokr.kr/bill
files_ko = kobill.fileids()         # Get file ids
doc_ko = kobill.open('1809890.txt').read()
print(doc_ko[:10])
#+end_src

#+RESULTS:
: 지방공무원법 일부개

#+begin_src ipython :results output
from nltk import regexp_tokenize
pattern = r'''(?x) ([A-Z]\.)+ | \w+(-\w+)* | \$?\d+(\.\d+)?%? | \.\.\. | [][.,;"'?():-_`]'''
tokens_en = regexp_tokenize(doc_en, pattern)
print(tokens_en[:300])

#+end_src

#+RESULTS:
: [('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '-use', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '-8', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '-one', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', ''), ('', '', '')]

#+begin_src ipython :results output
from konlpy.tag import Twitter

t = Twitter()
tokens_ko = t.morphs(doc_ko)
print(tokens_ko)
#+end_src
#+begin_src ipython :results output
ko = nltk.Text(tokens_ko, name='대한민국 국회 의안')
print(len(ko.tokens))
print(len(set(ko.tokens)))
print(ko.vocab())
print(t.tagset)
#+end_src

#+RESULTS:
: 1777
: 476
: <FreqDist with 476 samples and 1777 outcomes>
: {'Adjective': '형용사', 'Adverb': '부사', 'Alpha': '알파벳', 'Conjunction': '접속사', 'Determiner': '관형사', 'Eomi': '어미', 'Exclamation': '감탄사', 'Foreign': '외국어, 한자 및 기타기호', 'Hashtag': '트위터 해쉬태그', 'Josa': '조사', 'KoreanParticle': '(ex: ㅋㅋ)', 'Noun': '명사', 'Number': '숫자', 'PreEomi': '선어말어미', 'Punctuation': '구두점', 'ScreenName': '트위터 아이디', 'Suffix': '접미사', 'Unknown': '미등록어', 'Verb': '동사'}

#+begin_src ipython :results output
t1 = '정보산업진흥원에서  AI를 공부하고 있습니다.'
t2 = '작고 노란 강아지가 페르시안 고양이에게 짖었다.'
t3 = '메디게이트는 의사면허번호가 있어야만 가입이 되는 의사들의 회원제 사이트로 국내'
data1= t.pos(t1)
pprint(data1)
#+end_src

#+RESULTS:
#+begin_example
[('정보산업', 'Noun'),
 ('진흥', 'Noun'),
 ('원', 'Suffix'),
 ('에서', 'Josa'),
 ('AI', 'Alpha'),
 ('를', 'Noun'),
 ('공부', 'Noun'),
 ('하고', 'Josa'),
 ('있습니다', 'Adjective'),
 ('.', 'Punctuation')]
#+end_example

#+begin_src ipython :results output
  # from konlpy.tag import Mecab
  from konlpy.tag import Okt
  okt = Okt()
  kkma = Kkma()

  t0 = '아버지가방에들어가신다'
  pprint(okt.pos(t0))
  pprint(kkma.pos(t0))
#+end_src

#+RESULTS:
: [('아버지', 'Noun'), ('가방', 'Noun'), ('에', 'Josa'), ('들어가신다', 'Verb')]
: [('아버지', 'NNG'),
:  ('가방', 'NNG'),
:  ('에', 'JKM'),
:  ('들어가', 'VV'),
:  ('시', 'EPH'),
:  ('ㄴ다', 'EFN')]
